HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxOvc_reg.h
/**
 * \file IfxOvc_reg.h
 * \brief
 * \copyright Copyright (c) 2014 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC27XA_TS_V3.0.1.R2
 * Specification: TC27xA_TS_V3.0.1_SFR_OPEN_MARKET.xml (Revision: V3.0.1)
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Ovc_Cfg Ovc address
 * \ingroup IfxLld_Ovc
 * 
 * \defgroup IfxLld_Ovc_Cfg_BaseAddress Base address
 * \ingroup IfxLld_Ovc_Cfg
 * 
 * \defgroup IfxLld_Ovc_Cfg_Ovc0 2-OVC0
 * \ingroup IfxLld_Ovc_Cfg
 * 
 * \defgroup IfxLld_Ovc_Cfg_Ovc1 2-OVC1
 * \ingroup IfxLld_Ovc_Cfg
 * 
 * \defgroup IfxLld_Ovc_Cfg_Ovc2 2-OVC2
 * \ingroup IfxLld_Ovc_Cfg
 * 
 */
#ifndef IFXOVC_REG_H
#define IFXOVC_REG_H 1
/******************************************************************************/
#include "IfxOvc_regdef.h"
/******************************************************************************/
/** \addtogroup IfxLld_Ovc_Cfg_BaseAddress
 * \{  */

/** \\brief  OVC object */
#define MODULE_OVC0 /*lint --e(923)*/ ((*(Ifx_OVC*)0xF880FB00u))

/** \\brief  OVC object */
#define MODULE_OVC1 /*lint --e(923)*/ ((*(Ifx_OVC*)0xF882FB00u))

/** \\brief  OVC object */
#define MODULE_OVC2 /*lint --e(923)*/ ((*(Ifx_OVC*)0xF884FB00u))
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Ovc_Cfg_Ovc0
 * \{  */

/** \\brief  18, Overlay Mask Register */
#define OVC0_BLK0_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF880FB18u)

/** Alias (User Manual Name) for OVC0_BLK0_OMASK.
* To use register names with standard convension, please use OVC0_BLK0_OMASK.
*/
#define	OVC0_OMASK0	(OVC0_BLK0_OMASK)

/** \\brief  14, Overlay Target Address Register */
#define OVC0_BLK0_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF880FB14u)

/** Alias (User Manual Name) for OVC0_BLK0_OTAR.
* To use register names with standard convension, please use OVC0_BLK0_OTAR.
*/
#define	OVC0_OTAR0	(OVC0_BLK0_OTAR)

/** \\brief  10, Redirected Address Base Register */
#define OVC0_BLK0_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF880FB10u)

/** Alias (User Manual Name) for OVC0_BLK0_RABR.
* To use register names with standard convension, please use OVC0_BLK0_RABR.
*/
#define	OVC0_RABR0	(OVC0_BLK0_RABR)

/** \\brief  90, Overlay Mask Register */
#define OVC0_BLK10_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF880FB90u)

/** Alias (User Manual Name) for OVC0_BLK10_OMASK.
* To use register names with standard convension, please use OVC0_BLK10_OMASK.
*/
#define	OVC0_OMASK10	(OVC0_BLK10_OMASK)

/** \\brief  8C, Overlay Target Address Register */
#define OVC0_BLK10_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF880FB8Cu)

/** Alias (User Manual Name) for OVC0_BLK10_OTAR.
* To use register names with standard convension, please use OVC0_BLK10_OTAR.
*/
#define	OVC0_OTAR10	(OVC0_BLK10_OTAR)

/** \\brief  88, Redirected Address Base Register */
#define OVC0_BLK10_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF880FB88u)

/** Alias (User Manual Name) for OVC0_BLK10_RABR.
* To use register names with standard convension, please use OVC0_BLK10_RABR.
*/
#define	OVC0_RABR10	(OVC0_BLK10_RABR)

/** \\brief  9C, Overlay Mask Register */
#define OVC0_BLK11_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF880FB9Cu)

/** Alias (User Manual Name) for OVC0_BLK11_OMASK.
* To use register names with standard convension, please use OVC0_BLK11_OMASK.
*/
#define	OVC0_OMASK11	(OVC0_BLK11_OMASK)

/** \\brief  98, Overlay Target Address Register */
#define OVC0_BLK11_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF880FB98u)

/** Alias (User Manual Name) for OVC0_BLK11_OTAR.
* To use register names with standard convension, please use OVC0_BLK11_OTAR.
*/
#define	OVC0_OTAR11	(OVC0_BLK11_OTAR)

/** \\brief  94, Redirected Address Base Register */
#define OVC0_BLK11_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF880FB94u)

/** Alias (User Manual Name) for OVC0_BLK11_RABR.
* To use register names with standard convension, please use OVC0_BLK11_RABR.
*/
#define	OVC0_RABR11	(OVC0_BLK11_RABR)

/** \\brief  A8, Overlay Mask Register */
#define OVC0_BLK12_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF880FBA8u)

/** Alias (User Manual Name) for OVC0_BLK12_OMASK.
* To use register names with standard convension, please use OVC0_BLK12_OMASK.
*/
#define	OVC0_OMASK12	(OVC0_BLK12_OMASK)

/** \\brief  A4, Overlay Target Address Register */
#define OVC0_BLK12_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF880FBA4u)

/** Alias (User Manual Name) for OVC0_BLK12_OTAR.
* To use register names with standard convension, please use OVC0_BLK12_OTAR.
*/
#define	OVC0_OTAR12	(OVC0_BLK12_OTAR)

/** \\brief  A0, Redirected Address Base Register */
#define OVC0_BLK12_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF880FBA0u)

/** Alias (User Manual Name) for OVC0_BLK12_RABR.
* To use register names with standard convension, please use OVC0_BLK12_RABR.
*/
#define	OVC0_RABR12	(OVC0_BLK12_RABR)

/** \\brief  B4, Overlay Mask Register */
#define OVC0_BLK13_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF880FBB4u)

/** Alias (User Manual Name) for OVC0_BLK13_OMASK.
* To use register names with standard convension, please use OVC0_BLK13_OMASK.
*/
#define	OVC0_OMASK13	(OVC0_BLK13_OMASK)

/** \\brief  B0, Overlay Target Address Register */
#define OVC0_BLK13_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF880FBB0u)

/** Alias (User Manual Name) for OVC0_BLK13_OTAR.
* To use register names with standard convension, please use OVC0_BLK13_OTAR.
*/
#define	OVC0_OTAR13	(OVC0_BLK13_OTAR)

/** \\brief  AC, Redirected Address Base Register */
#define OVC0_BLK13_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF880FBACu)

