HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxOvc_reg.h
/** \\brief  128, Overlay Target Address Register */
#define OVC1_BLK23_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FC28u)

/** Alias (User Manual Name) for OVC1_BLK23_OTAR.
* To use register names with standard convension, please use OVC1_BLK23_OTAR.
*/
#define	OVC1_OTAR23	(OVC1_BLK23_OTAR)

/** \\brief  124, Redirected Address Base Register */
#define OVC1_BLK23_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FC24u)

/** Alias (User Manual Name) for OVC1_BLK23_RABR.
* To use register names with standard convension, please use OVC1_BLK23_RABR.
*/
#define	OVC1_RABR23	(OVC1_BLK23_RABR)

/** \\brief  138, Overlay Mask Register */
#define OVC1_BLK24_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FC38u)

/** Alias (User Manual Name) for OVC1_BLK24_OMASK.
* To use register names with standard convension, please use OVC1_BLK24_OMASK.
*/
#define	OVC1_OMASK24	(OVC1_BLK24_OMASK)

/** \\brief  134, Overlay Target Address Register */
#define OVC1_BLK24_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FC34u)

/** Alias (User Manual Name) for OVC1_BLK24_OTAR.
* To use register names with standard convension, please use OVC1_BLK24_OTAR.
*/
#define	OVC1_OTAR24	(OVC1_BLK24_OTAR)

/** \\brief  130, Redirected Address Base Register */
#define OVC1_BLK24_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FC30u)

/** Alias (User Manual Name) for OVC1_BLK24_RABR.
* To use register names with standard convension, please use OVC1_BLK24_RABR.
*/
#define	OVC1_RABR24	(OVC1_BLK24_RABR)

/** \\brief  144, Overlay Mask Register */
#define OVC1_BLK25_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FC44u)

/** Alias (User Manual Name) for OVC1_BLK25_OMASK.
* To use register names with standard convension, please use OVC1_BLK25_OMASK.
*/
#define	OVC1_OMASK25	(OVC1_BLK25_OMASK)

/** \\brief  140, Overlay Target Address Register */
#define OVC1_BLK25_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FC40u)

/** Alias (User Manual Name) for OVC1_BLK25_OTAR.
* To use register names with standard convension, please use OVC1_BLK25_OTAR.
*/
#define	OVC1_OTAR25	(OVC1_BLK25_OTAR)

/** \\brief  13C, Redirected Address Base Register */
#define OVC1_BLK25_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FC3Cu)

/** Alias (User Manual Name) for OVC1_BLK25_RABR.
* To use register names with standard convension, please use OVC1_BLK25_RABR.
*/
#define	OVC1_RABR25	(OVC1_BLK25_RABR)

/** \\brief  150, Overlay Mask Register */
#define OVC1_BLK26_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FC50u)

/** Alias (User Manual Name) for OVC1_BLK26_OMASK.
* To use register names with standard convension, please use OVC1_BLK26_OMASK.
*/
#define	OVC1_OMASK26	(OVC1_BLK26_OMASK)

/** \\brief  14C, Overlay Target Address Register */
#define OVC1_BLK26_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FC4Cu)

/** Alias (User Manual Name) for OVC1_BLK26_OTAR.
* To use register names with standard convension, please use OVC1_BLK26_OTAR.
*/
#define	OVC1_OTAR26	(OVC1_BLK26_OTAR)

/** \\brief  148, Redirected Address Base Register */
#define OVC1_BLK26_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FC48u)

/** Alias (User Manual Name) for OVC1_BLK26_RABR.
* To use register names with standard convension, please use OVC1_BLK26_RABR.
*/
#define	OVC1_RABR26	(OVC1_BLK26_RABR)

/** \\brief  15C, Overlay Mask Register */
#define OVC1_BLK27_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FC5Cu)

/** Alias (User Manual Name) for OVC1_BLK27_OMASK.
* To use register names with standard convension, please use OVC1_BLK27_OMASK.
*/
#define	OVC1_OMASK27	(OVC1_BLK27_OMASK)

/** \\brief  158, Overlay Target Address Register */
#define OVC1_BLK27_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FC58u)

/** Alias (User Manual Name) for OVC1_BLK27_OTAR.
* To use register names with standard convension, please use OVC1_BLK27_OTAR.
*/
#define	OVC1_OTAR27	(OVC1_BLK27_OTAR)

/** \\brief  154, Redirected Address Base Register */
#define OVC1_BLK27_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FC54u)

/** Alias (User Manual Name) for OVC1_BLK27_RABR.
* To use register names with standard convension, please use OVC1_BLK27_RABR.
*/
#define	OVC1_RABR27	(OVC1_BLK27_RABR)

/** \\brief  168, Overlay Mask Register */
#define OVC1_BLK28_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FC68u)

/** Alias (User Manual Name) for OVC1_BLK28_OMASK.
* To use register names with standard convension, please use OVC1_BLK28_OMASK.
*/
#define	OVC1_OMASK28	(OVC1_BLK28_OMASK)

/** \\brief  164, Overlay Target Address Register */
#define OVC1_BLK28_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FC64u)

/** Alias (User Manual Name) for OVC1_BLK28_OTAR.
* To use register names with standard convension, please use OVC1_BLK28_OTAR.
*/
#define	OVC1_OTAR28	(OVC1_BLK28_OTAR)

/** \\brief  160, Redirected Address Base Register */
#define OVC1_BLK28_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FC60u)

/** Alias (User Manual Name) for OVC1_BLK28_RABR.
* To use register names with standard convension, please use OVC1_BLK28_RABR.
*/
#define	OVC1_RABR28	(OVC1_BLK28_RABR)

/** \\brief  174, Overlay Mask Register */
#define OVC1_BLK29_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FC74u)

/** Alias (User Manual Name) for OVC1_BLK29_OMASK.
* To use register names with standard convension, please use OVC1_BLK29_OMASK.
*/
#define	OVC1_OMASK29	(OVC1_BLK29_OMASK)

/** \\brief  170, Overlay Target Address Register */
#define OVC1_BLK29_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FC70u)

/** Alias (User Manual Name) for OVC1_BLK29_OTAR.
* To use register names with standard convension, please use OVC1_BLK29_OTAR.
*/
#define	OVC1_OTAR29	(OVC1_BLK29_OTAR)

/** \\brief  16C, Redirected Address Base Register */
#define OVC1_BLK29_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FC6Cu)

/** Alias (User Manual Name) for OVC1_BLK29_RABR.
* To use register names with standard convension, please use OVC1_BLK29_RABR.
*/
#define	OVC1_RABR29	(OVC1_BLK29_RABR)

