HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxOvc_reg.h
/** \\brief  FC, Overlay Mask Register */
#define OVC2_BLK19_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FBFCu)

/** Alias (User Manual Name) for OVC2_BLK19_OMASK.
* To use register names with standard convension, please use OVC2_BLK19_OMASK.
*/
#define	OVC2_OMASK19	(OVC2_BLK19_OMASK)

/** \\brief  F8, Overlay Target Address Register */
#define OVC2_BLK19_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FBF8u)

/** Alias (User Manual Name) for OVC2_BLK19_OTAR.
* To use register names with standard convension, please use OVC2_BLK19_OTAR.
*/
#define	OVC2_OTAR19	(OVC2_BLK19_OTAR)

/** \\brief  F4, Redirected Address Base Register */
#define OVC2_BLK19_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FBF4u)

/** Alias (User Manual Name) for OVC2_BLK19_RABR.
* To use register names with standard convension, please use OVC2_BLK19_RABR.
*/
#define	OVC2_RABR19	(OVC2_BLK19_RABR)

/** \\brief  24, Overlay Mask Register */
#define OVC2_BLK1_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FB24u)

/** Alias (User Manual Name) for OVC2_BLK1_OMASK.
* To use register names with standard convension, please use OVC2_BLK1_OMASK.
*/
#define	OVC2_OMASK1	(OVC2_BLK1_OMASK)

/** \\brief  20, Overlay Target Address Register */
#define OVC2_BLK1_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FB20u)

/** Alias (User Manual Name) for OVC2_BLK1_OTAR.
* To use register names with standard convension, please use OVC2_BLK1_OTAR.
*/
#define	OVC2_OTAR1	(OVC2_BLK1_OTAR)

/** \\brief  1C, Redirected Address Base Register */
#define OVC2_BLK1_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FB1Cu)

/** Alias (User Manual Name) for OVC2_BLK1_RABR.
* To use register names with standard convension, please use OVC2_BLK1_RABR.
*/
#define	OVC2_RABR1	(OVC2_BLK1_RABR)

/** \\brief  108, Overlay Mask Register */
#define OVC2_BLK20_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FC08u)

/** Alias (User Manual Name) for OVC2_BLK20_OMASK.
* To use register names with standard convension, please use OVC2_BLK20_OMASK.
*/
#define	OVC2_OMASK20	(OVC2_BLK20_OMASK)

/** \\brief  104, Overlay Target Address Register */
#define OVC2_BLK20_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FC04u)

/** Alias (User Manual Name) for OVC2_BLK20_OTAR.
* To use register names with standard convension, please use OVC2_BLK20_OTAR.
*/
#define	OVC2_OTAR20	(OVC2_BLK20_OTAR)

/** \\brief  100, Redirected Address Base Register */
#define OVC2_BLK20_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FC00u)

/** Alias (User Manual Name) for OVC2_BLK20_RABR.
* To use register names with standard convension, please use OVC2_BLK20_RABR.
*/
#define	OVC2_RABR20	(OVC2_BLK20_RABR)

/** \\brief  114, Overlay Mask Register */
#define OVC2_BLK21_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FC14u)

/** Alias (User Manual Name) for OVC2_BLK21_OMASK.
* To use register names with standard convension, please use OVC2_BLK21_OMASK.
*/
#define	OVC2_OMASK21	(OVC2_BLK21_OMASK)

/** \\brief  110, Overlay Target Address Register */
#define OVC2_BLK21_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FC10u)

/** Alias (User Manual Name) for OVC2_BLK21_OTAR.
* To use register names with standard convension, please use OVC2_BLK21_OTAR.
*/
#define	OVC2_OTAR21	(OVC2_BLK21_OTAR)

/** \\brief  10C, Redirected Address Base Register */
#define OVC2_BLK21_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FC0Cu)

/** Alias (User Manual Name) for OVC2_BLK21_RABR.
* To use register names with standard convension, please use OVC2_BLK21_RABR.
*/
#define	OVC2_RABR21	(OVC2_BLK21_RABR)

/** \\brief  120, Overlay Mask Register */
#define OVC2_BLK22_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FC20u)

/** Alias (User Manual Name) for OVC2_BLK22_OMASK.
* To use register names with standard convension, please use OVC2_BLK22_OMASK.
*/
#define	OVC2_OMASK22	(OVC2_BLK22_OMASK)

/** \\brief  11C, Overlay Target Address Register */
#define OVC2_BLK22_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FC1Cu)

/** Alias (User Manual Name) for OVC2_BLK22_OTAR.
* To use register names with standard convension, please use OVC2_BLK22_OTAR.
*/
#define	OVC2_OTAR22	(OVC2_BLK22_OTAR)

/** \\brief  118, Redirected Address Base Register */
#define OVC2_BLK22_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FC18u)

/** Alias (User Manual Name) for OVC2_BLK22_RABR.
* To use register names with standard convension, please use OVC2_BLK22_RABR.
*/
#define	OVC2_RABR22	(OVC2_BLK22_RABR)

/** \\brief  12C, Overlay Mask Register */
#define OVC2_BLK23_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FC2Cu)

/** Alias (User Manual Name) for OVC2_BLK23_OMASK.
* To use register names with standard convension, please use OVC2_BLK23_OMASK.
*/
#define	OVC2_OMASK23	(OVC2_BLK23_OMASK)

/** \\brief  128, Overlay Target Address Register */
#define OVC2_BLK23_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FC28u)

/** Alias (User Manual Name) for OVC2_BLK23_OTAR.
* To use register names with standard convension, please use OVC2_BLK23_OTAR.
*/
#define	OVC2_OTAR23	(OVC2_BLK23_OTAR)

/** \\brief  124, Redirected Address Base Register */
#define OVC2_BLK23_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FC24u)

/** Alias (User Manual Name) for OVC2_BLK23_RABR.
* To use register names with standard convension, please use OVC2_BLK23_RABR.
*/
#define	OVC2_RABR23	(OVC2_BLK23_RABR)

/** \\brief  138, Overlay Mask Register */
#define OVC2_BLK24_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FC38u)

/** Alias (User Manual Name) for OVC2_BLK24_OMASK.
* To use register names with standard convension, please use OVC2_BLK24_OMASK.
*/
#define	OVC2_OMASK24	(OVC2_BLK24_OMASK)

/** \\brief  134, Overlay Target Address Register */
#define OVC2_BLK24_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FC34u)

/** Alias (User Manual Name) for OVC2_BLK24_OTAR.
* To use register names with standard convension, please use OVC2_BLK24_OTAR.
*/
#define	OVC2_OTAR24	(OVC2_BLK24_OTAR)

/** \\brief  130, Redirected Address Base Register */
#define OVC2_BLK24_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FC30u)

/** Alias (User Manual Name) for OVC2_BLK24_RABR.
* To use register names with standard convension, please use OVC2_BLK24_RABR.
*/
#define	OVC2_RABR24	(OVC2_BLK24_RABR)

/** \\brief  144, Overlay Mask Register */
#define OVC2_BLK25_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FC44u)

/** Alias (User Manual Name) for OVC2_BLK25_OMASK.
* To use register names with standard convension, please use OVC2_BLK25_OMASK.
*/
#define	OVC2_OMASK25	(OVC2_BLK25_OMASK)

