HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxOvc_reg.h
/** Alias (User Manual Name) for OVC2_BLK31_OTAR.
* To use register names with standard convension, please use OVC2_BLK31_OTAR.
*/
#define	OVC2_OTAR31	(OVC2_BLK31_OTAR)

/** \\brief  184, Redirected Address Base Register */
#define OVC2_BLK31_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FC84u)

/** Alias (User Manual Name) for OVC2_BLK31_RABR.
* To use register names with standard convension, please use OVC2_BLK31_RABR.
*/
#define	OVC2_RABR31	(OVC2_BLK31_RABR)

/** \\brief  3C, Overlay Mask Register */
#define OVC2_BLK3_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FB3Cu)

/** Alias (User Manual Name) for OVC2_BLK3_OMASK.
* To use register names with standard convension, please use OVC2_BLK3_OMASK.
*/
#define	OVC2_OMASK3	(OVC2_BLK3_OMASK)

/** \\brief  38, Overlay Target Address Register */
#define OVC2_BLK3_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FB38u)

/** Alias (User Manual Name) for OVC2_BLK3_OTAR.
* To use register names with standard convension, please use OVC2_BLK3_OTAR.
*/
#define	OVC2_OTAR3	(OVC2_BLK3_OTAR)

/** \\brief  34, Redirected Address Base Register */
#define OVC2_BLK3_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FB34u)

/** Alias (User Manual Name) for OVC2_BLK3_RABR.
* To use register names with standard convension, please use OVC2_BLK3_RABR.
*/
#define	OVC2_RABR3	(OVC2_BLK3_RABR)

/** \\brief  48, Overlay Mask Register */
#define OVC2_BLK4_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FB48u)

/** Alias (User Manual Name) for OVC2_BLK4_OMASK.
* To use register names with standard convension, please use OVC2_BLK4_OMASK.
*/
#define	OVC2_OMASK4	(OVC2_BLK4_OMASK)

/** \\brief  44, Overlay Target Address Register */
#define OVC2_BLK4_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FB44u)

/** Alias (User Manual Name) for OVC2_BLK4_OTAR.
* To use register names with standard convension, please use OVC2_BLK4_OTAR.
*/
#define	OVC2_OTAR4	(OVC2_BLK4_OTAR)

/** \\brief  40, Redirected Address Base Register */
#define OVC2_BLK4_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FB40u)

/** Alias (User Manual Name) for OVC2_BLK4_RABR.
* To use register names with standard convension, please use OVC2_BLK4_RABR.
*/
#define	OVC2_RABR4	(OVC2_BLK4_RABR)

/** \\brief  54, Overlay Mask Register */
#define OVC2_BLK5_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FB54u)

/** Alias (User Manual Name) for OVC2_BLK5_OMASK.
* To use register names with standard convension, please use OVC2_BLK5_OMASK.
*/
#define	OVC2_OMASK5	(OVC2_BLK5_OMASK)

/** \\brief  50, Overlay Target Address Register */
#define OVC2_BLK5_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FB50u)

/** Alias (User Manual Name) for OVC2_BLK5_OTAR.
* To use register names with standard convension, please use OVC2_BLK5_OTAR.
*/
#define	OVC2_OTAR5	(OVC2_BLK5_OTAR)

/** \\brief  4C, Redirected Address Base Register */
#define OVC2_BLK5_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FB4Cu)

/** Alias (User Manual Name) for OVC2_BLK5_RABR.
* To use register names with standard convension, please use OVC2_BLK5_RABR.
*/
#define	OVC2_RABR5	(OVC2_BLK5_RABR)

/** \\brief  60, Overlay Mask Register */
#define OVC2_BLK6_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FB60u)

/** Alias (User Manual Name) for OVC2_BLK6_OMASK.
* To use register names with standard convension, please use OVC2_BLK6_OMASK.
*/
#define	OVC2_OMASK6	(OVC2_BLK6_OMASK)

/** \\brief  5C, Overlay Target Address Register */
#define OVC2_BLK6_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FB5Cu)

/** Alias (User Manual Name) for OVC2_BLK6_OTAR.
* To use register names with standard convension, please use OVC2_BLK6_OTAR.
*/
#define	OVC2_OTAR6	(OVC2_BLK6_OTAR)

/** \\brief  58, Redirected Address Base Register */
#define OVC2_BLK6_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FB58u)

/** Alias (User Manual Name) for OVC2_BLK6_RABR.
* To use register names with standard convension, please use OVC2_BLK6_RABR.
*/
#define	OVC2_RABR6	(OVC2_BLK6_RABR)

/** \\brief  6C, Overlay Mask Register */
#define OVC2_BLK7_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FB6Cu)

/** Alias (User Manual Name) for OVC2_BLK7_OMASK.
* To use register names with standard convension, please use OVC2_BLK7_OMASK.
*/
#define	OVC2_OMASK7	(OVC2_BLK7_OMASK)

/** \\brief  68, Overlay Target Address Register */
#define OVC2_BLK7_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FB68u)

/** Alias (User Manual Name) for OVC2_BLK7_OTAR.
* To use register names with standard convension, please use OVC2_BLK7_OTAR.
*/
#define	OVC2_OTAR7	(OVC2_BLK7_OTAR)

/** \\brief  64, Redirected Address Base Register */
#define OVC2_BLK7_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FB64u)

/** Alias (User Manual Name) for OVC2_BLK7_RABR.
* To use register names with standard convension, please use OVC2_BLK7_RABR.
*/
#define	OVC2_RABR7	(OVC2_BLK7_RABR)

/** \\brief  78, Overlay Mask Register */
#define OVC2_BLK8_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FB78u)

/** Alias (User Manual Name) for OVC2_BLK8_OMASK.
* To use register names with standard convension, please use OVC2_BLK8_OMASK.
*/
#define	OVC2_OMASK8	(OVC2_BLK8_OMASK)

/** \\brief  74, Overlay Target Address Register */
#define OVC2_BLK8_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FB74u)

/** Alias (User Manual Name) for OVC2_BLK8_OTAR.
* To use register names with standard convension, please use OVC2_BLK8_OTAR.
*/
#define	OVC2_OTAR8	(OVC2_BLK8_OTAR)

/** \\brief  70, Redirected Address Base Register */
#define OVC2_BLK8_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FB70u)

/** Alias (User Manual Name) for OVC2_BLK8_RABR.
* To use register names with standard convension, please use OVC2_BLK8_RABR.
*/
#define	OVC2_RABR8	(OVC2_BLK8_RABR)

/** \\brief  84, Overlay Mask Register */
#define OVC2_BLK9_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FB84u)

/** Alias (User Manual Name) for OVC2_BLK9_OMASK.
* To use register names with standard convension, please use OVC2_BLK9_OMASK.
*/
#define	OVC2_OMASK9	(OVC2_BLK9_OMASK)

/** \\brief  80, Overlay Target Address Register */
#define OVC2_BLK9_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FB80u)

/** Alias (User Manual Name) for OVC2_BLK9_OTAR.
* To use register names with standard convension, please use OVC2_BLK9_OTAR.
*/
#define	OVC2_OTAR9	(OVC2_BLK9_OTAR)

/** \\brief  7C, Redirected Address Base Register */
#define OVC2_BLK9_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FB7Cu)

/** Alias (User Manual Name) for OVC2_BLK9_RABR.
* To use register names with standard convension, please use OVC2_BLK9_RABR.
*/
#define	OVC2_RABR9	(OVC2_BLK9_RABR)

/** \\brief  0, Overlay Range Select Register */
#define OVC2_OSEL /*lint --e(923)*/ (*(volatile Ifx_OVC_OSEL*)0xF884FB00u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXOVC_REG_H */
